# =============================================================================
# VS Code Extensions Brewfile - Shared across all profiles
# =============================================================================
# Managed separately since extensions change independently of CLI/GUI packages

vscode "anthropic.claude-code"          # Claude Code integration
vscode "bradlc.vscode-tailwindcss"      # Tailwind CSS IntelliSense
vscode "dbaeumer.vscode-eslint"         # ESLint integration
vscode "eamodio.gitlens"                # Git supercharged
vscode "biomejs.biome"                  # Biome formatter/linter
vscode "editorconfig.editorconfig"      # EditorConfig support
vscode "github.copilot-chat"            # Copilot Chat
vscode "kevinrose.vsc-python-indent"    # Python indentation
vscode "ms-azuretools.vscode-containers" # Docker containers
vscode "ms-python.debugpy"              # Python debugger
vscode "ms-python.python"               # Python support
vscode "ms-python.vscode-pylance"       # Python language server
vscode "ms-python.vscode-python-envs"   # Python environments
vscode "ms-vscode-remote.remote-containers" # Dev containers
vscode "svelte.svelte-vscode"           # Svelte support
vscode "tamasfe.even-better-toml"       # TOML support
vscode "usernamehw.errorlens"           # Inline error highlighting
vscode "esbenp.prettier-vscode"         # Prettier formatter
vscode "foxundermoon.shell-format"      # Shell script formatter
vscode "enkia.tokyo-night"              # Tokyo Night color theme
vscode "vscodevim.vim"                  # Vim keybindings
vscode "ms-vscode.makefile-tools"      # Makefile support
