# =============================================================================
# Apps Brewfile - GUI applications
# =============================================================================
# CLI tools go in Brewfile.cli, VS Code extensions in Brewfile.vscode

# -----------------------------------------------------------------------------
# Fonts
# -----------------------------------------------------------------------------
cask "font-fira-code"            # Monospace font with ligatures
cask "font-fira-code-nerd-font"  # Nerd Font variant (icons for Neovim)
cask "font-hack-nerd-font"            # Patched font with icons
cask "font-symbols-only-nerd-font"  # Standalone Nerd Font icons (fallback)

# -----------------------------------------------------------------------------
# Core Applications
# -----------------------------------------------------------------------------
cask "claude"               # Claude AI desktop app
cask "claude-code"          # Claude Code (coding assistant)
cask "ghostty"              # Fast, feature-rich terminal
cask "google-chrome"        # Web browser
cask "lm-studio"            # Local LLM GUI
cask "obsidian"             # Note-taking and knowledge base
cask "raycast"              # Spotlight replacement
cask "visual-studio-code"   # Code editor

# -----------------------------------------------------------------------------
# Productivity & Communication
# -----------------------------------------------------------------------------
cask "figma"                # Design and prototyping tool
cask "linear-linear"        # Project management
cask "meetingbar"           # Meeting bar menu extra
cask "orbstack"             # Docker and Linux VM manager
cask "slack"                # Team communication
cask "yaak"                 # API client

# -----------------------------------------------------------------------------
# Development
# -----------------------------------------------------------------------------
cask "dbeaver-community"    # Universal database tool
cask "gcloud-cli"           # Google Cloud SDK
cask "rider"                # .NET IDE

# -----------------------------------------------------------------------------
# Browsers
# -----------------------------------------------------------------------------
cask "firefox"              # Privacy-focused browser
cask "helium-browser"       # Floating browser window
cask "zen"                  # Minimal browser

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------
cask "discord"              # Gaming/community chat
cask "signal"               # Encrypted messaging
cask "whatsapp"             # Messaging

# -----------------------------------------------------------------------------
# Media & Entertainment
# -----------------------------------------------------------------------------
cask "iina"                 # Modern media player
cask "rekordbox"            # DJ software
cask "sonos"                # Sonos speaker control
cask "spotify"              # Music streaming
cask "steam"                # Gaming platform

# -----------------------------------------------------------------------------
# Creative Tools
# -----------------------------------------------------------------------------
cask "affinity"             # Affinity Designer/Photo suite
cask "processing"           # Creative coding IDE

# -----------------------------------------------------------------------------
# Other
# -----------------------------------------------------------------------------
cask "arduino-ide"          # Arduino development
cask "dropbox"              # Cloud storage
cask "epic-games"           # Epic Games launcher
cask "trackweight"          # Weight tracking
tap "spicetify/tap"
cask "steipete/tap/codexbar"
