# =============================================================================
# Personal Brewfile - Personal machine packages only
# =============================================================================
# Packages specific to personal projects and hobbies
# Common packages shared with work go in Brewfile.cli, Brewfile.apps, Brewfile.vscode

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "krishkrosh/apps"
tap "spicetify/homebrew-tap"

# -----------------------------------------------------------------------------
# CLI Tools
# -----------------------------------------------------------------------------
brew "mailsy"        # Disposable email CLI
brew "openclaw-cli"  # OpenClaw CLI
brew "qrencode"      # QR code generator
brew "signal-cli"    # Signal messenger CLI

# -----------------------------------------------------------------------------
# Browsers
# -----------------------------------------------------------------------------
cask "firefox"         # Privacy-focused browser
cask "helium-browser"  # Floating browser window
cask "zen"             # Minimal browser

# -----------------------------------------------------------------------------
# Communication
# -----------------------------------------------------------------------------
cask "discord"   # Gaming/community chat
cask "signal"    # Encrypted messaging
cask "whatsapp"  # Messaging

# -----------------------------------------------------------------------------
# Media & Entertainment
# -----------------------------------------------------------------------------
brew "spicetify-cli"  # Spotify theming tool
cask "iina"           # Modern media player
cask "rekordbox"      # DJ software
cask "sonos"          # Sonos speaker control
cask "spotify"        # Music streaming
cask "steam"          # Gaming platform

# -----------------------------------------------------------------------------
# Creative Tools
# -----------------------------------------------------------------------------
cask "affinity"     # Affinity Designer/Photo suite
cask "processing"   # Creative coding IDE

# -----------------------------------------------------------------------------
# Productivity
# -----------------------------------------------------------------------------
cask "dropbox"      # Cloud storage
cask "trackweight"  # Weight tracking (from krishkrosh/apps tap)

# -----------------------------------------------------------------------------
# Gaming & Other
# -----------------------------------------------------------------------------
cask "arduino-ide"  # Arduino development
cask "epic-games"   # Epic Games launcher
