# =============================================================================
# VS Code Extensions Brewfile - Shared across all profiles
# =============================================================================
# Source of truth: stow/vscode/.../extensions.txt
# This file must stay in sync — run `make brew-audit` to detect drift.

# AI Tools
vscode "anthropic.claude-code"               # Claude Code AI coding assistant
vscode "github.copilot-chat"                 # GitHub Copilot chat interface

# Code Quality & Formatting
vscode "biomejs.biome"                       # Fast formatter and linter (JS/TS/JSON)
vscode "editorconfig.editorconfig"           # EditorConfig support
vscode "dbaeumer.vscode-eslint"              # JavaScript/TypeScript linter
vscode "esbenp.prettier-vscode"              # Prettier formatter
vscode "foxundermoon.shell-format"           # Shell script formatter
vscode "usernamehw.errorlens"                # Inline error highlighting

# Git
vscode "eamodio.gitlens"                     # Git supercharged (blame, history)

# Theme
vscode "enkia.tokyo-night"                   # Tokyo Night color theme

# Editor
vscode "vscodevim.vim"                       # Vim keybindings
vscode "ms-vscode.makefile-tools"            # Makefile support

# Language Support - JavaScript/TypeScript
vscode "bradlc.vscode-tailwindcss"           # Tailwind CSS IntelliSense
vscode "svelte.svelte-vscode"                # Svelte framework support

# Language Support - Python
vscode "ms-python.python"                    # Full Python language support
vscode "ms-python.vscode-pylance"            # Python language server
vscode "ms-python.debugpy"                   # Python debugger
vscode "ms-python.vscode-python-envs"        # Python environment management
vscode "kevinrose.vsc-python-indent"         # Smart Python indentation

# Language Support - C#
vscode "ms-dotnettools.csdevkit"             # C# Dev Kit (LSP, debugging, project management)

# Language Support - Go
vscode "golang.go"                           # Go language support (gopls, debugging, testing)

# Language Support - Rust
vscode "rust-lang.rust-analyzer"             # Rust language server

# Language Support - Ruby
vscode "shopify.ruby-lsp"                    # Ruby language server

# Language Support - Zig
vscode "ziglang.vscode-zig"                  # Zig language support (ZLS)

# Language Support - Lua
vscode "sumneko.lua"                         # Lua language server

# Language Support - Other
vscode "tamasfe.even-better-toml"            # TOML syntax and formatting

# DevOps & Remote
vscode "ms-vscode-remote.remote-containers"  # Dev containers support
vscode "ms-azuretools.vscode-containers"     # Docker/container support
