# =============================================================================
# CLI Brewfile - Command-line tools shared across all profiles
# =============================================================================
# Formulae installed on both personal and work machines
# GUI apps go in Brewfile.apps, VS Code extensions in Brewfile.vscode

# -----------------------------------------------------------------------------
# Taps
# -----------------------------------------------------------------------------
tap "steipete/tap"
tap "yakitrak/yakitrak"

# -----------------------------------------------------------------------------
# Shell & Terminal
# -----------------------------------------------------------------------------
brew "zsh-autosuggestions"      # Fish-like autosuggestions
brew "zsh-syntax-highlighting"  # Syntax highlighting in zsh
brew "zsh-you-should-use"       # Reminds you of existing aliases
brew "starship"                  # Cross-shell prompt (primary backend)
brew "fzf"                       # Fuzzy finder for command line
brew "gum"                       # Interactive terminal UI components
brew "zoxide"                    # Smarter cd command (z)
brew "atuin"                     # Shell history with search UI (local-only mode)
brew "ghq"                       # Git repository manager for local checkouts
brew "sesh"                      # Terminal session manager (zoxide/fzf driven)
brew "fd"                        # Fast find alternative
brew "yazi"                      # Terminal file manager
brew "tmux"                      # Terminal multiplexer

# -----------------------------------------------------------------------------
# Core CLI Tools
# -----------------------------------------------------------------------------
brew "bat"           # Better cat with syntax highlighting
brew "btop"          # Resource monitor with TUI
brew "eza"           # Modern replacement for ls
brew "grc"           # Colorize command output
brew "ripgrep"       # Fast grep alternative (rg)
brew "tree"          # Directory tree visualization
brew "stow"          # Symlink farm manager (dotfiles)
brew "parallel"      # GNU parallel for concurrent job execution
brew "gh"            # GitHub CLI
brew "git"           # Git version control (prefer Homebrew over Apple Git)
brew "git-delta"     # Better git diffs
brew "lazygit"       # Terminal UI for git
brew "neovim"        # Modern vim
brew "vim"           # Classic vim (fallback)

brew "dust"          # Better du (disk usage)

# -----------------------------------------------------------------------------
# Development Tools
# -----------------------------------------------------------------------------
brew "bash"          # Modern bash (macOS ships with old version)
brew "biome"         # Fast formatter and linter (JS/TS/JSON)
brew "fnm"           # Fast Node version manager
brew "node"          # Fallback Node.js (fnm takes priority via PATH)
brew "lua"           # Lua programming language
brew "luarocks"      # Lua package manager
brew "pnpm"          # Fast npm alternative
brew "ruff"          # Fast Python linter
brew "rustup"        # Rust toolchain manager (rustc, cargo, rustfmt)
brew "uv"            # Fast Python package and project manager
brew "go"            # Go programming language
brew "rbenv"         # Ruby version manager
brew "ruby-build"    # rbenv plugin: install Ruby versions
brew "zig"           # Zig programming language
brew "jq"            # JSON processor
brew "yq"            # YAML processor
brew "prettier"      # Code formatter (multi-language)
brew "shellcheck"    # Shell script linter
brew "shellharden"   # Shell script hardening linter
brew "tealdeer"      # Fast tldr client for quick command examples

# Note: tsx not currently installed but available if needed
# brew "tsx"         # TypeScript execution

# -----------------------------------------------------------------------------
# Security & Privacy
# -----------------------------------------------------------------------------
brew "gnupg"         # GPG encryption
brew "pinentry-mac"  # GPG passphrase entry for macOS

# -----------------------------------------------------------------------------
# System Utilities
# -----------------------------------------------------------------------------
brew "dive"                  # Docker image layer explorer
brew "dockutil"             # Manage Dock items declaratively
brew "mac-cleanup-go"       # System cleanup utility
brew "obsidian-cli"         # Obsidian CLI tools
brew "ollama", restart_service: :changed  # Local LLM runtime
tap "manaflow-ai/cmux"
cask "cmux"
