# Taps
tap "steipete/tap"

# CLI tools
brew "bat"
brew "dust"
brew "eza"
brew "fd"
brew "fnm"
brew "fzf"
brew "gh"
brew "git-delta"
brew "gnupg"
brew "lazygit"
brew "mac-cleanup-go"
brew "neovim"
brew "pinentry-mac"
brew "vim"
brew "ollama", restart_service: :changed
brew "pnpm"
brew "powerlevel10k"
brew "ripgrep"
brew "ruff"
brew "rust"
brew "stow"
brew "tree"
brew "tsx"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# Fonts
cask "font-fira-code"
cask "font-hack-nerd-font"

# Core apps
cask "claude"
cask "claude-code"
cask "steipete/tap/codexbar"
cask "ghostty"
cask "google-chrome"
cask "lm-studio"
cask "obsidian"
cask "raycast"
cask "visual-studio-code"

# VS Code extensions
vscode "anthropic.claude-code"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "usernamehw.errorlens"
