tap "krishkrosh/apps"
tap "steipete/tap"
brew "bat"
brew "dive"
brew "dotnet@8"
brew "eza"
brew "fnm"
brew "gh"
brew "gnupg"
brew "mac-cleanup-go"
brew "mailsy"
brew "ollama", restart_service: :changed
brew "pnpm"
brew "powerlevel10k"
brew "ruff"
brew "rust"
brew "stow"
brew "tree"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
cask "affinity"
cask "arduino-ide"
cask "claude"
cask "claude-code"
cask "steipete/tap/codexbar"
cask "dbeaver-community"
cask "discord"
cask "dropbox"
cask "figma"
cask "firefox"
cask "font-fira-code"
cask "font-hack-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "google-chrome"
cask "helium-browser"
cask "iina"
cask "linear-linear"
cask "lm-studio"
cask "meetingbar"
cask "obsidian"
cask "orbstack"
cask "processing"
cask "raycast"
cask "rekordbox"
cask "rider"
cask "signal"
cask "slack"
cask "sonos"
cask "spotify"
cask "steam"
cask "krishkrosh/apps/trackweight"
cask "visual-studio-code"
cask "whatsapp"
cask "yaak"
cask "zen"
vscode "anthropic.claude-code"
vscode "editorconfig.editorconfig"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "kevinrose.vsc-python-indent"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
