brew "dive"
brew "fish"
brew "fnm"
brew "gnupg"
brew "stow"
cask "dbeaver-community"
cask "figma"
cask "font-hack-nerd-font"
cask "ghostty"
cask "iterm2"
cask "obsidian"
cask "orbstack"
cask "processing"
cask "raycast"
cask "rider"
cask "signal"
cask "slack"
cask "spotify"
cask "steam"
cask "visual-studio-code"
cask "whatsapp"
cask "yaak"
cask "zen"
